sim/simple_cylinder_wall_modeled/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            empty;
        physicalType    empty;
        nFaces          29640;
        startFace       29326;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          80;
        startFace       58966;
    }
    topBot
    {
        type            patch;
        physicalType    patch;
        nFaces          268;
        startFace       59046;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          80;
        startFace       59314;
    }
    wall
    {
        type            wall;
        physicalType    wall;
        nFaces          200;
        startFace       59394;
    }
)

// ************************************************************************* //
