sim/simple_cylinder_wall_modeled/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p
        tolerance       1e-6;
        relTol          0;
    }

    "(U|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
        nSweeps         1;
    }

    "(U|nuTilda)Final"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
	minIter		1;
    }

}

PIMPLE
{
    nOuterCorrectors 50;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    consistent yes;
    
    residualControl
    {
        "(p|nuTilda)"
        {
        	relTol      0;
        	tolerance   1e-5;
        }
	U
	{
		relTol		0;
		tolerance 1e-6;
	}
    }
}



SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;
    
    residualControl
    {
        p           1e-6;
        U           1e-6;
        nuTilda     1e-6;
    }
}



relaxationFactors
{
    fields
    {
        p       	0.3;
    }
    equations
    {
        p               0.7;
        U               0.7;
        nuTilda         0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
