sim/simple_cylinder_wall_modeled/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type                forces;
    libs  		          ("libforces.so");
    writeControl	      timeStep;
    writeInterval    	  1;

    patches         	  (wall);
    p    		            p;
    U    		            U;
    rho    		          rhoInf;
    rhoInf		          1.225;

    log 		            true;

    CofR                (0 0 0);  // Axle midpoint on ground
}




// ************************************************************************* //
